In [1]:
#Time Series Pediction
import pandas as pd

In [3]:
list_df=pd.read_html("https://www.bankbazaar.com/gold-rate/gold-rate-trend-in-india.html")
len(list_df)

1

In [4]:
df=list_df[0]
df

                 Year Price (24 Karat per 10 grams)
0   2025 (Till Today)                  ₹1,11,350.00
1                2024                    ₹77,913.00
2                2023                    ₹65,330.00
3                2022                    ₹52,670.00
4                2021                    ₹48,720.00
..                ...                           ...
56               1968                       ₹162.00
57               1967                       ₹102.50
58               1966                        ₹83.75
59               1965                        ₹71.75
60               1964                        ₹63.25

[61 rows x 2 columns]

In [5]:
def clean(price):
    return price.replace("₹","").replace(",","")
clean("₹65,330.00")

'65330.00'

In [6]:
df.rename({'Price (24 Karat per 10 grams)':'Price'},axis=1,inplace=True)

In [7]:
df

                 Year         Price
0   2025 (Till Today)  ₹1,11,350.00
1                2024    ₹77,913.00
2                2023    ₹65,330.00
3                2022    ₹52,670.00
4                2021    ₹48,720.00
..                ...           ...
56               1968       ₹162.00
57               1967       ₹102.50
58               1966        ₹83.75
59               1965        ₹71.75
60               1964        ₹63.25

[61 rows x 2 columns]

In [8]:
df.Price=df.Price.apply(clean)
df

                 Year      Price
0   2025 (Till Today)  111350.00
1                2024   77913.00
2                2023   65330.00
3                2022   52670.00
4                2021   48720.00
..                ...        ...
56               1968     162.00
57               1967     102.50
58               1966      83.75
59               1965      71.75
60               1964      63.25

[61 rows x 2 columns]

In [9]:
df.Price=df.Price.astype('float')
df

                 Year      Price
0   2025 (Till Today)  111350.00
1                2024   77913.00
2                2023   65330.00
3                2022   52670.00
4                2021   48720.00
..                ...        ...
56               1968     162.00
57               1967     102.50
58               1966      83.75
59               1965      71.75
60               1964      63.25

[61 rows x 2 columns]

In [11]:
df.sort_values(by='Year',inplace=True)

In [45]:
df

                 Year      Price
60               1964      63.25
59               1965      71.75
58               1966      83.75
57               1967     102.50
56               1968     162.00
..                ...        ...
4                2021   48720.00
3                2022   52670.00
2                2023   65330.00
1                2024   77913.00
0   2025 (Till Today)  111350.00

[61 rows x 2 columns]

In [74]:
def create_data(data, input_steps, output_steps):
    inputs = []
    targets = []
    for i in range(len(data) - input_steps - output_steps + 1):
        inputs.append(data[i : i + input_steps]) # Input window
        targets.append(data[i + input_steps : i + input_steps + output_steps]) # O
    return np.array(inputs), np.array(targets)

In [75]:
X,y=create_data(df.Price,5,1)

In [76]:
import pandas as pd
import numpy as np
from tensorflow.keras.layers import SimpleRNN,Dense,Embedding,LSTM
from tensorflow.keras.models import Sequential
import random
import tensorflow as tf

In [86]:
model=Sequential()
model.add(SimpleRNN(200,activation='relu'))
model.add(Dense(400,activation='relu'))
model.add(Dense(200,activation='relu'))
model.add(Dense(1))
model.compile(loss='huber',optimizer='adam',metrics=['r2_score'])
model.fit(X.reshape(X.shape[0],X.shape[1],1),y,batch_size=30,epochs=10)

Epoch 1/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 2s 33ms/step - loss: 14322.9297 - r2_score: -0.3737
Epoch 2/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 47ms/step - loss: 9000.4941 - r2_score: 0.3770
Epoch 3/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 40ms/step - loss: 3291.5659 - r2_score: 0.9179
Epoch 4/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 38ms/step - loss: 4871.7329 - r2_score: 0.8507
Epoch 5/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 35ms/step - loss: 2586.6106 - r2_score: 0.9600
Epoch 6/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 27ms/step - loss: 3183.7942 - r2_score: 0.8863
Epoch 7/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 25ms/step - loss: 3566.6763 - r2_score: 0.8565
Epoch 8/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 28ms/step - loss: 2319.5593 - r2_score: 0.9331
Epoch 9/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 35ms/step - loss: 2642.3306 - r2_score: 0.9471
Epoch 10/10
2/2 ━━━━━━━━━━━━━━━━━━━━ 0s 36ms/step - loss: 2941.9956 - r2_score: 0.9453

In [87]:
new_sample=[48720.00,52670,65330.00,77913.00,111350]
model.predict(np.array(new_sample).reshape(1,5,1))

1/1 ━━━━━━━━━━━━━━━━━━━━ 0s 169ms/step

array([[126587.01]], dtype=float32)